"""
  @Author       : liujianhan
  @Date         : 2021/8/12 18:15
  @Project      : DailyTinyImprovement
  @FileName     : demo.py
  @Description  : Placeholder
"""
from bs4 import BeautifulSoup

if __name__ == '__main__':
    content = """<div>
	<p>
		有多少人为情所困，又有多少人相爱相杀，明明彼此深爱着对方，却又被爱伤得遍体鳞伤，他们看不懂、参不透。
	</p>
	<p>
		到底自己与恋人是缘是劫，不禁发出这样的感慨：大千世界，你我在茫茫人海中相遇，若不是有缘，怎么会遇见，若说是缘，那为什么又互相伤害？
	</p>
	<p>
		对于异性之间是缘还是劫，也有人这样说：不是冤家不聚头；若无相欠，怎会相见……
	</p>
	<p>
		其实，这些都是人们用一种玄学的思维，来解释两个相爱的人不能好好相处的原因。
	</p>
	<p>
		从爱情心理学角度来分析，就简单多了，异性之间，到底是缘还是劫，其实很好判断，能过以下几个方面的剖析就能得出结论。
	</p>
	<p>
		<img class="mu-ue-image" src="https://pic-weimi.seeyouyima.com/news/img/mp_326087301_16221607954084102564_641_427.jpg?x-oss-process=image/watermark,text_576O5p-aQOivtOeIsQ,color_ffffff,t_80,shadow_50,size_21,x_20,y_20" /> 
	</p>
	<p>
		是不是志同道合，三观相近
	</p>
	<p>
		异性相处，最重要的就是，两人三观是否相近，也就是说两人是不是志同道合，毕竟物以类聚，人以群分。
	</p>
	<p>
		不是一类人，相处起来是不会愉快的，因为不在一个思想维度，不在一个认知层面，往往会出现，你不知我，我不懂你的现象。
	</p>
	<p>
		契合度高的异性，更容易成为佳偶，因为两人的志趣相投，兴趣爱好相近，有共同话题，沟通起来也比较顺畅。
	</p>
	<p>
		当生活中出现问题时，两人的意见也极易达成一致，在一定程度上，两人还可以成为最佳拍档。
	</p>
	<p>
		志同者，道必合，道不同，则不相为谋。
	</p>
	<p>
		志同道合，佳偶天成。
	</p>
	<p>
		<img class="mu-ue-image" src="https://pic-weimi.seeyouyima.com/news/img/mp_326087301_16221607951095674292_641_361.jpg?x-oss-process=image/watermark,text_576O5p-aQOivtOeIsQ,color_ffffff,t_80,shadow_50,size_21,x_20,y_20" /> 
	</p>
	<p>
		是不是互相欣赏，相处轻松愉快
	</p>
	<p>
		相爱的前提是相互欣赏，彼此赞许，如果两个人相处时，你做事，我欣赏，我说话，你认同，那是一件非常快乐的事情。
	</p>
	<p>
		基于彼此的喜欢，认可对方的所说所做，因此，两人互生爱慕，而建立在互相欣赏和尊重基础上的感情，一般都会比较稳固。
	</p>
	<p>
		人之幸运，无非是遇到了对的那个人，也就是人们常说的“正缘”，“缘”又源自“愿”，有缘相遇，有幸相知，有爱相伴，愿望达成。
	</p>
	<p>
		爱情没有标准答案，但是在交往过程中，能够互相沟通交流，能够共同进步，使双方都能受益的感情，一定是对人生有积极意义的。
	</p>
	<p>
		如果，两人相处没有信任、没有尊重，没有欣赏；经常为了一点小事争执，互相猜忌，互相诋毁，甚至有的情侣大打出手，那就一定是“劫”了。
	</p>
	<p>
		<img class="mu-ue-image" src="https://pic-weimi.seeyouyima.com/news/img/mp_326087301_1622160795116314980_641_426.jpg?x-oss-process=image/watermark,text_576O5p-aQOivtOeIsQ,color_ffffff,t_80,shadow_50,size_21,x_20,y_20" /> 
	</p>
	<p>
		是否相处快乐，有幸福感
	</p>
	<p>
		佛说：前世五百次地回眸，才换来今生的擦肩而过。
	</p>
	<p>
		今生能够遇见，算是有缘，若是遇到了那个对的人，又对你非常珍惜，你们不仅互相爱慕，而且在一起的时候感到快乐幸福，那么这就算是善缘了。
	</p>
	<p>
		人生的目标终究是寻求快乐，都说人生苦短，谁都希望烦恼少一点，快乐多一些，如果两个人在一起，相处起来轻松快乐，有幸福感，是缘。
	</p>
	<p>
		人生就是一个不断选择的过程，不同的选择就决定着不同的结果；选择又因目的而起，当你选择快乐幸福时，就要选择那个在一起时，彼此有快乐感、幸福感的人作为伴侣。
	</p>
	<p>
		是缘就珍惜，是劫就放过
	</p>
	<p>
		遇到了有缘人，就敞开心扉拥抱对方，以诚相待，用心去感知，经营好自己的爱情。
	</p>
	<p>
		如果遇人不淑，或者遇到了和自己格格不入的人，即使再喜欢，也请放手，那毕竟不是属于你的爱情。
	</p>
	<p>
		在感情里，一定要保持头脑清醒，选择伴侣关系到一生的幸福，和一个什么样的人生活在一起，就决定了一个什么样的人生，人们常说：选择伴侣的同时，就是选择了一种生活方式。
	</p>
	<p>
		以后的生活是幸福快乐的，还是煎熬痛苦的，主动权是可以掌握在我们自己手中的。
	</p>
	<p>
		<img class="mu-ue-image" src="https://pic-weimi.seeyouyima.com/news/img/mp_326087301_16221607954269676501_641_427.jpg?x-oss-process=image/watermark,text_576O5p-aQOivtOeIsQ,color_ffffff,t_80,shadow_50,size_21,x_20,y_20" /> 
	</p>
	<p>
		婚前应睁大眼睛看清彼此是不是合适，婚后就睁一只眼闭一只眼，互相包容，这样才能经营好自己的感情和婚姻。
	</p>
	<p>
		有些人做的恰恰相反，婚前让爱情冲昏了头脑，不顾家人的反对，不听朋友的意见，执意选择了一个和自己不匹配的那个人。
	</p>
	<p>
		婚后才看清楚了两人这段感情的本来面目，两个人根本不是一个世界的人，在激情褪去，归于平淡的日子里，每是面对柴米油盐时，矛盾重重，无休止地争吵让彼此疲惫不堪。
	</p>
	<p>
		<img src="https://pic-weimi.seeyouyima.com/news/img/mp_326087301_16221608013273539173__.jpg?x-oss-process=image/watermark,text_576O5p-aQOivtOeIsQ,color_ffffff,t_80,shadow_50,size_21,x_20,y_20" class="mu-ue-image" /> 
	</p>
	<p>
		所谓异性之间，到底是缘还是劫，归要结底，就是说，你们到底合适不合适，这样解释，相信很多人就不再在感情里困惑了，判断你们的感情时，也就简单多了。
	</p>
	<p>
		综上：有幸得佳偶，人生便圆满了一半，有良人在侧，共度朝夕，共度四季，共看看潮起潮落，从此，人生路上不再寂寞。
	</p>
	<p>
		缘是环境，是机会，有缘相遇，应珍惜。
	</p>
	<p>
		缘又是愿，是心愿，心愿达成，应感激。
	</p>
	<p>
		缘是因，是动机，劫是果，是恶果，当止损。
	</p>
	<p>
		<br />
	</p>
</div>"""
    soup = BeautifulSoup(content, 'html.parser')
    clean_content = [s.strip() for s in soup.strings if s.strip()]
    print(soup.prettify())
